# frozen_string_literal: true

# APQP/PPAP フェーズごとの項目リスト
# index2, index3, index8, index9 ビューで共通使用
APQP_PHASES = {
  1 => ['顧客インプット', '顧客の声', '設計目標', '製品保証計画書', '製品・製造工程の前提条件',
        '製品・製造工程のベンチマークデータ', '製品の信頼性調査', '経営者の支援',
        '特殊製品特性・特殊プロセス特性の暫定リスト', '暫定材料明細表', '暫定プロセスマップフロー図',
        '信頼性目標・品質目標', '事業計画・マーケティング戦略'].freeze,
  2 => ['試作コントロールプラン', '設計検証', '設計故障モード影響解析（DFMEA）',
        '製造性・組立性を考慮した設計', '特殊製品特性・特殊プロセス特性', '材料仕様書', '技術仕様書',
        '実現可能性検討報告書および経営者の支援', '図面（数学的データを含む）', '図面・仕様書の変更',
        'デザインレビュー', 'ゲージ・試験装置の要求事項'].freeze,
  3 => ['製品・プロセスの品質システムのレビュー', '経営者の支援(Phase3)', '特性マトリクス',
        '測定システム解析計画書', '梱包規格・仕様書', '工程能力予備調査計画書',
        '先行生産（Pre-launch,量産試作）コントロールプラン', 'プロセス故障モード影響解析（PFMEA）',
        'プロセス指示書', 'プロセスフロー図(Phase3)', 'フロアプランレイアウト'].freeze,
  4 => ['量産コントロールプラン', '量産の妥当性確認試験', '生産部品承認(PPAP)', '測定システム解析',
        '梱包評価', '工程能力予備調査', '実質的生産', '品質計画承認署名'].freeze,
  5 => ['顧客満足の向上', '引渡しおよびサービスの改善', '学んだ教訓・ベストプラクティスの効果的な利用',
        '変動の減少'].freeze,
  6 => ['顧客技術承認', '顧客固有要求事項適合記録', '部品提出保証書（PSW)', '設計FMEA', '製品設計文書',
        '製品サンプル', '測定システム解析（MSA)', '検査補助具', '材料・性能試験結果', '有資格試験所文書',
        '技術変更文書（顧客承認）', '寸法測定結果', '外観承認報告書（AAR)', '初期工程調査結果',
        'マスターサンプル', 'プロセスフロー図', 'プロセスFMEA', 'バルク材料チェックリスト',
        'コントロールプラン'].freeze
}.freeze
